SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_agc.h
/* Bit fields for AGC FENOTCHATT7 */
#define _AGC_FENOTCHATT7_RESETVALUE                    0x20080000UL                                      /**< Default value for AGC_FENOTCHATT7           */
#define _AGC_FENOTCHATT7_MASK                          0x3FFF3FFFUL                                      /**< Mask for AGC_FENOTCHATT7                    */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL15_SHIFT        0                                                 /**< Shift value for AGC_FENOTCHATTNSEL15        */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL15_MASK         0xFUL                                             /**< Bit mask for AGC_FENOTCHATTNSEL15           */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL15_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHATTNSEL15_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHATTNSEL15_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE15_SHIFT        4                                                 /**< Shift value for AGC_FENOTCHCAPCRSE15        */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE15_MASK         0xF0UL                                            /**< Bit mask for AGC_FENOTCHCAPCRSE15           */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE15_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHCAPCRSE15_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHCAPCRSE15_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE15_SHIFT        8                                                 /**< Shift value for AGC_FENOTCHCAPFINE15        */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE15_MASK         0xF00UL                                           /**< Bit mask for AGC_FENOTCHCAPFINE15           */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE15_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHCAPFINE15_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHCAPFINE15_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define AGC_FENOTCHATT7_FENOTCHRATTNEN15               (0x1UL << 12)                                     /**< FE notch rattn enable for index 15          */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN15_SHIFT        12                                                /**< Shift value for AGC_FENOTCHRATTNEN15        */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN15_MASK         0x1000UL                                          /**< Bit mask for AGC_FENOTCHRATTNEN15           */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN15_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHRATTNEN15_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHRATTNEN15_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define AGC_FENOTCHATT7_FENOTCHEN15                    (0x1UL << 13)                                     /**< FE notch enable for index 15                */
#define _AGC_FENOTCHATT7_FENOTCHEN15_SHIFT             13                                                /**< Shift value for AGC_FENOTCHEN15             */
#define _AGC_FENOTCHATT7_FENOTCHEN15_MASK              0x2000UL                                          /**< Bit mask for AGC_FENOTCHEN15                */
#define _AGC_FENOTCHATT7_FENOTCHEN15_DEFAULT           0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHEN15_DEFAULT            (_AGC_FENOTCHATT7_FENOTCHEN15_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL16_SHIFT        16                                                /**< Shift value for AGC_FENOTCHATTNSEL16        */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL16_MASK         0xF0000UL                                         /**< Bit mask for AGC_FENOTCHATTNSEL16           */
#define _AGC_FENOTCHATT7_FENOTCHATTNSEL16_DEFAULT      0x00000008UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHATTNSEL16_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHATTNSEL16_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE16_SHIFT        20                                                /**< Shift value for AGC_FENOTCHCAPCRSE16        */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE16_MASK         0xF00000UL                                        /**< Bit mask for AGC_FENOTCHCAPCRSE16           */
#define _AGC_FENOTCHATT7_FENOTCHCAPCRSE16_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHCAPCRSE16_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHCAPCRSE16_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE16_SHIFT        24                                                /**< Shift value for AGC_FENOTCHCAPFINE16        */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE16_MASK         0xF000000UL                                       /**< Bit mask for AGC_FENOTCHCAPFINE16           */
#define _AGC_FENOTCHATT7_FENOTCHCAPFINE16_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHCAPFINE16_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHCAPFINE16_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define AGC_FENOTCHATT7_FENOTCHRATTNEN16               (0x1UL << 28)                                     /**< FE notch rattn enable for index 16          */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN16_SHIFT        28                                                /**< Shift value for AGC_FENOTCHRATTNEN16        */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN16_MASK         0x10000000UL                                      /**< Bit mask for AGC_FENOTCHRATTNEN16           */
#define _AGC_FENOTCHATT7_FENOTCHRATTNEN16_DEFAULT      0x00000000UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHRATTNEN16_DEFAULT       (_AGC_FENOTCHATT7_FENOTCHRATTNEN16_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */
#define AGC_FENOTCHATT7_FENOTCHEN16                    (0x1UL << 29)                                     /**< FE notch enable for index 16                */
#define _AGC_FENOTCHATT7_FENOTCHEN16_SHIFT             29                                                /**< Shift value for AGC_FENOTCHEN16             */
#define _AGC_FENOTCHATT7_FENOTCHEN16_MASK              0x20000000UL                                      /**< Bit mask for AGC_FENOTCHEN16                */
#define _AGC_FENOTCHATT7_FENOTCHEN16_DEFAULT           0x00000001UL                                      /**< Mode DEFAULT for AGC_FENOTCHATT7            */
#define AGC_FENOTCHATT7_FENOTCHEN16_DEFAULT            (_AGC_FENOTCHATT7_FENOTCHEN16_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHATT7    */

