SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_agc.h
/* Bit fields for AGC FENOTCHFILT8 */
#define _AGC_FENOTCHFILT8_RESETVALUE                   0x200B200AUL                                       /**< Default value for AGC_FENOTCHFILT8          */
#define _AGC_FENOTCHFILT8_MASK                         0x3FFF3FFFUL                                       /**< Mask for AGC_FENOTCHFILT8                   */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL17_SHIFT       0                                                  /**< Shift value for AGC_FENOTCHATTNSEL17        */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL17_MASK        0xFUL                                              /**< Bit mask for AGC_FENOTCHATTNSEL17           */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL17_DEFAULT     0x0000000AUL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHATTNSEL17_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHATTNSEL17_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE17_SHIFT       4                                                  /**< Shift value for AGC_FENOTCHCAPCRSE17        */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE17_MASK        0xF0UL                                             /**< Bit mask for AGC_FENOTCHCAPCRSE17           */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE17_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHCAPCRSE17_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHCAPCRSE17_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE17_SHIFT       8                                                  /**< Shift value for AGC_FENOTCHCAPFINE17        */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE17_MASK        0xF00UL                                            /**< Bit mask for AGC_FENOTCHCAPFINE17           */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE17_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHCAPFINE17_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHCAPFINE17_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define AGC_FENOTCHFILT8_FENOTCHRATTNEN17              (0x1UL << 12)                                      /**< FE notch rattn enable for index 17          */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN17_SHIFT       12                                                 /**< Shift value for AGC_FENOTCHRATTNEN17        */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN17_MASK        0x1000UL                                           /**< Bit mask for AGC_FENOTCHRATTNEN17           */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN17_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHRATTNEN17_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHRATTNEN17_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define AGC_FENOTCHFILT8_FENOTCHEN17                   (0x1UL << 13)                                      /**< FE notch enable for index 17                */
#define _AGC_FENOTCHFILT8_FENOTCHEN17_SHIFT            13                                                 /**< Shift value for AGC_FENOTCHEN17             */
#define _AGC_FENOTCHFILT8_FENOTCHEN17_MASK             0x2000UL                                           /**< Bit mask for AGC_FENOTCHEN17                */
#define _AGC_FENOTCHFILT8_FENOTCHEN17_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHEN17_DEFAULT           (_AGC_FENOTCHFILT8_FENOTCHEN17_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL18_SHIFT       16                                                 /**< Shift value for AGC_FENOTCHATTNSEL18        */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL18_MASK        0xF0000UL                                          /**< Bit mask for AGC_FENOTCHATTNSEL18           */
#define _AGC_FENOTCHFILT8_FENOTCHATTNSEL18_DEFAULT     0x0000000BUL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHATTNSEL18_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHATTNSEL18_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE18_SHIFT       20                                                 /**< Shift value for AGC_FENOTCHCAPCRSE18        */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE18_MASK        0xF00000UL                                         /**< Bit mask for AGC_FENOTCHCAPCRSE18           */
#define _AGC_FENOTCHFILT8_FENOTCHCAPCRSE18_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHCAPCRSE18_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHCAPCRSE18_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE18_SHIFT       24                                                 /**< Shift value for AGC_FENOTCHCAPFINE18        */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE18_MASK        0xF000000UL                                        /**< Bit mask for AGC_FENOTCHCAPFINE18           */
#define _AGC_FENOTCHFILT8_FENOTCHCAPFINE18_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHCAPFINE18_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHCAPFINE18_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define AGC_FENOTCHFILT8_FENOTCHRATTNEN18              (0x1UL << 28)                                      /**< FE notch rattn enable for index 18          */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN18_SHIFT       28                                                 /**< Shift value for AGC_FENOTCHRATTNEN18        */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN18_MASK        0x10000000UL                                       /**< Bit mask for AGC_FENOTCHRATTNEN18           */
#define _AGC_FENOTCHFILT8_FENOTCHRATTNEN18_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHRATTNEN18_DEFAULT      (_AGC_FENOTCHFILT8_FENOTCHRATTNEN18_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */
#define AGC_FENOTCHFILT8_FENOTCHEN18                   (0x1UL << 29)                                      /**< FE notch enable for index 18                */
#define _AGC_FENOTCHFILT8_FENOTCHEN18_SHIFT            29                                                 /**< Shift value for AGC_FENOTCHEN18             */
#define _AGC_FENOTCHFILT8_FENOTCHEN18_MASK             0x20000000UL                                       /**< Bit mask for AGC_FENOTCHEN18                */
#define _AGC_FENOTCHFILT8_FENOTCHEN18_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT8           */
#define AGC_FENOTCHFILT8_FENOTCHEN18_DEFAULT           (_AGC_FENOTCHFILT8_FENOTCHEN18_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT8   */

/* Bit fields for AGC FENOTCHFILT9 */
#define _AGC_FENOTCHFILT9_RESETVALUE                   0x200B200BUL                                       /**< Default value for AGC_FENOTCHFILT9          */
#define _AGC_FENOTCHFILT9_MASK                         0x3FFF3FFFUL                                       /**< Mask for AGC_FENOTCHFILT9                   */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL19_SHIFT       0                                                  /**< Shift value for AGC_FENOTCHATTNSEL19        */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL19_MASK        0xFUL                                              /**< Bit mask for AGC_FENOTCHATTNSEL19           */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL19_DEFAULT     0x0000000BUL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHATTNSEL19_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHATTNSEL19_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE19_SHIFT       4                                                  /**< Shift value for AGC_FENOTCHCAPCRSE19        */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE19_MASK        0xF0UL                                             /**< Bit mask for AGC_FENOTCHCAPCRSE19           */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE19_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHCAPCRSE19_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHCAPCRSE19_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE19_SHIFT       8                                                  /**< Shift value for AGC_FENOTCHCAPFINE19        */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE19_MASK        0xF00UL                                            /**< Bit mask for AGC_FENOTCHCAPFINE19           */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE19_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHCAPFINE19_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHCAPFINE19_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define AGC_FENOTCHFILT9_FENOTCHRATTNEN19              (0x1UL << 12)                                      /**< FE notch rattn enable for index 19          */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN19_SHIFT       12                                                 /**< Shift value for AGC_FENOTCHRATTNEN19        */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN19_MASK        0x1000UL                                           /**< Bit mask for AGC_FENOTCHRATTNEN19           */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN19_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHRATTNEN19_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHRATTNEN19_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define AGC_FENOTCHFILT9_FENOTCHEN19                   (0x1UL << 13)                                      /**< FE notch enable for index 19                */
#define _AGC_FENOTCHFILT9_FENOTCHEN19_SHIFT            13                                                 /**< Shift value for AGC_FENOTCHEN19             */
#define _AGC_FENOTCHFILT9_FENOTCHEN19_MASK             0x2000UL                                           /**< Bit mask for AGC_FENOTCHEN19                */
#define _AGC_FENOTCHFILT9_FENOTCHEN19_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHEN19_DEFAULT           (_AGC_FENOTCHFILT9_FENOTCHEN19_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL20_SHIFT       16                                                 /**< Shift value for AGC_FENOTCHATTNSEL20        */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL20_MASK        0xF0000UL                                          /**< Bit mask for AGC_FENOTCHATTNSEL20           */
#define _AGC_FENOTCHFILT9_FENOTCHATTNSEL20_DEFAULT     0x0000000BUL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHATTNSEL20_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHATTNSEL20_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE20_SHIFT       20                                                 /**< Shift value for AGC_FENOTCHCAPCRSE20        */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE20_MASK        0xF00000UL                                         /**< Bit mask for AGC_FENOTCHCAPCRSE20           */
#define _AGC_FENOTCHFILT9_FENOTCHCAPCRSE20_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHCAPCRSE20_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHCAPCRSE20_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE20_SHIFT       24                                                 /**< Shift value for AGC_FENOTCHCAPFINE20        */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE20_MASK        0xF000000UL                                        /**< Bit mask for AGC_FENOTCHCAPFINE20           */
#define _AGC_FENOTCHFILT9_FENOTCHCAPFINE20_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHCAPFINE20_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHCAPFINE20_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define AGC_FENOTCHFILT9_FENOTCHRATTNEN20              (0x1UL << 28)                                      /**< FE notch rattn enable for index 20          */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN20_SHIFT       28                                                 /**< Shift value for AGC_FENOTCHRATTNEN20        */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN20_MASK        0x10000000UL                                       /**< Bit mask for AGC_FENOTCHRATTNEN20           */
#define _AGC_FENOTCHFILT9_FENOTCHRATTNEN20_DEFAULT     0x00000000UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHRATTNEN20_DEFAULT      (_AGC_FENOTCHFILT9_FENOTCHRATTNEN20_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */
#define AGC_FENOTCHFILT9_FENOTCHEN20                   (0x1UL << 29)                                      /**< FE notch enable for index 20                */
#define _AGC_FENOTCHFILT9_FENOTCHEN20_SHIFT            29                                                 /**< Shift value for AGC_FENOTCHEN20             */
#define _AGC_FENOTCHFILT9_FENOTCHEN20_MASK             0x20000000UL                                       /**< Bit mask for AGC_FENOTCHEN20                */
#define _AGC_FENOTCHFILT9_FENOTCHEN20_DEFAULT          0x00000001UL                                       /**< Mode DEFAULT for AGC_FENOTCHFILT9           */
#define AGC_FENOTCHFILT9_FENOTCHEN20_DEFAULT           (_AGC_FENOTCHFILT9_FENOTCHEN20_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT9   */

