SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/BGM24/Include/bgm24_agc.h
/* Bit fields for AGC FENOTCHFILT10 */
#define _AGC_FENOTCHFILT10_RESETVALUE                  0x200B200BUL                                        /**< Default value for AGC_FENOTCHFILT10         */
#define _AGC_FENOTCHFILT10_MASK                        0x3FFF3FFFUL                                        /**< Mask for AGC_FENOTCHFILT10                  */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL21_SHIFT      0                                                   /**< Shift value for AGC_FENOTCHATTNSEL21        */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL21_MASK       0xFUL                                               /**< Bit mask for AGC_FENOTCHATTNSEL21           */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL21_DEFAULT    0x0000000BUL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHATTNSEL21_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHATTNSEL21_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE21_SHIFT      4                                                   /**< Shift value for AGC_FENOTCHCAPCRSE21        */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE21_MASK       0xF0UL                                              /**< Bit mask for AGC_FENOTCHCAPCRSE21           */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE21_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHCAPCRSE21_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHCAPCRSE21_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE21_SHIFT      8                                                   /**< Shift value for AGC_FENOTCHCAPFINE21        */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE21_MASK       0xF00UL                                             /**< Bit mask for AGC_FENOTCHCAPFINE21           */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE21_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHCAPFINE21_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHCAPFINE21_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define AGC_FENOTCHFILT10_FENOTCHRATTNEN21             (0x1UL << 12)                                       /**< FE notch rattn enable for index 21          */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN21_SHIFT      12                                                  /**< Shift value for AGC_FENOTCHRATTNEN21        */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN21_MASK       0x1000UL                                            /**< Bit mask for AGC_FENOTCHRATTNEN21           */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN21_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHRATTNEN21_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHRATTNEN21_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define AGC_FENOTCHFILT10_FENOTCHEN21                  (0x1UL << 13)                                       /**< FE notch enable for index 21                */
#define _AGC_FENOTCHFILT10_FENOTCHEN21_SHIFT           13                                                  /**< Shift value for AGC_FENOTCHEN21             */
#define _AGC_FENOTCHFILT10_FENOTCHEN21_MASK            0x2000UL                                            /**< Bit mask for AGC_FENOTCHEN21                */
#define _AGC_FENOTCHFILT10_FENOTCHEN21_DEFAULT         0x00000001UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHEN21_DEFAULT          (_AGC_FENOTCHFILT10_FENOTCHEN21_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL22_SHIFT      16                                                  /**< Shift value for AGC_FENOTCHATTNSEL22        */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL22_MASK       0xF0000UL                                           /**< Bit mask for AGC_FENOTCHATTNSEL22           */
#define _AGC_FENOTCHFILT10_FENOTCHATTNSEL22_DEFAULT    0x0000000BUL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHATTNSEL22_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHATTNSEL22_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE22_SHIFT      20                                                  /**< Shift value for AGC_FENOTCHCAPCRSE22        */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE22_MASK       0xF00000UL                                          /**< Bit mask for AGC_FENOTCHCAPCRSE22           */
#define _AGC_FENOTCHFILT10_FENOTCHCAPCRSE22_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHCAPCRSE22_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHCAPCRSE22_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE22_SHIFT      24                                                  /**< Shift value for AGC_FENOTCHCAPFINE22        */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE22_MASK       0xF000000UL                                         /**< Bit mask for AGC_FENOTCHCAPFINE22           */
#define _AGC_FENOTCHFILT10_FENOTCHCAPFINE22_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHCAPFINE22_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHCAPFINE22_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define AGC_FENOTCHFILT10_FENOTCHRATTNEN22             (0x1UL << 28)                                       /**< FE notch rattn enable for index 22          */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN22_SHIFT      28                                                  /**< Shift value for AGC_FENOTCHRATTNEN22        */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN22_MASK       0x10000000UL                                        /**< Bit mask for AGC_FENOTCHRATTNEN22           */
#define _AGC_FENOTCHFILT10_FENOTCHRATTNEN22_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHRATTNEN22_DEFAULT     (_AGC_FENOTCHFILT10_FENOTCHRATTNEN22_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */
#define AGC_FENOTCHFILT10_FENOTCHEN22                  (0x1UL << 29)                                       /**< FE notch enable for index 22                */
#define _AGC_FENOTCHFILT10_FENOTCHEN22_SHIFT           29                                                  /**< Shift value for AGC_FENOTCHEN22             */
#define _AGC_FENOTCHFILT10_FENOTCHEN22_MASK            0x20000000UL                                        /**< Bit mask for AGC_FENOTCHEN22                */
#define _AGC_FENOTCHFILT10_FENOTCHEN22_DEFAULT         0x00000001UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT10          */
#define AGC_FENOTCHFILT10_FENOTCHEN22_DEFAULT          (_AGC_FENOTCHFILT10_FENOTCHEN22_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT10  */

/* Bit fields for AGC FENOTCHFILT11 */
#define _AGC_FENOTCHFILT11_RESETVALUE                  0x200B200BUL                                        /**< Default value for AGC_FENOTCHFILT11         */
#define _AGC_FENOTCHFILT11_MASK                        0x3FFF3FFFUL                                        /**< Mask for AGC_FENOTCHFILT11                  */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL23_SHIFT      0                                                   /**< Shift value for AGC_FENOTCHATTNSEL23        */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL23_MASK       0xFUL                                               /**< Bit mask for AGC_FENOTCHATTNSEL23           */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL23_DEFAULT    0x0000000BUL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHATTNSEL23_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHATTNSEL23_DEFAULT << 0)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE23_SHIFT      4                                                   /**< Shift value for AGC_FENOTCHCAPCRSE23        */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE23_MASK       0xF0UL                                              /**< Bit mask for AGC_FENOTCHCAPCRSE23           */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE23_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHCAPCRSE23_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHCAPCRSE23_DEFAULT << 4)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE23_SHIFT      8                                                   /**< Shift value for AGC_FENOTCHCAPFINE23        */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE23_MASK       0xF00UL                                             /**< Bit mask for AGC_FENOTCHCAPFINE23           */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE23_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHCAPFINE23_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHCAPFINE23_DEFAULT << 8)  /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define AGC_FENOTCHFILT11_FENOTCHRATTNEN23             (0x1UL << 12)                                       /**< FE notch rattn enable for index 23          */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN23_SHIFT      12                                                  /**< Shift value for AGC_FENOTCHRATTNEN23        */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN23_MASK       0x1000UL                                            /**< Bit mask for AGC_FENOTCHRATTNEN23           */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN23_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHRATTNEN23_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHRATTNEN23_DEFAULT << 12) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define AGC_FENOTCHFILT11_FENOTCHEN23                  (0x1UL << 13)                                       /**< FE notch enable for index 23                */
#define _AGC_FENOTCHFILT11_FENOTCHEN23_SHIFT           13                                                  /**< Shift value for AGC_FENOTCHEN23             */
#define _AGC_FENOTCHFILT11_FENOTCHEN23_MASK            0x2000UL                                            /**< Bit mask for AGC_FENOTCHEN23                */
#define _AGC_FENOTCHFILT11_FENOTCHEN23_DEFAULT         0x00000001UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHEN23_DEFAULT          (_AGC_FENOTCHFILT11_FENOTCHEN23_DEFAULT << 13)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL24_SHIFT      16                                                  /**< Shift value for AGC_FENOTCHATTNSEL24        */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL24_MASK       0xF0000UL                                           /**< Bit mask for AGC_FENOTCHATTNSEL24           */
#define _AGC_FENOTCHFILT11_FENOTCHATTNSEL24_DEFAULT    0x0000000BUL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHATTNSEL24_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHATTNSEL24_DEFAULT << 16) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE24_SHIFT      20                                                  /**< Shift value for AGC_FENOTCHCAPCRSE24        */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE24_MASK       0xF00000UL                                          /**< Bit mask for AGC_FENOTCHCAPCRSE24           */
#define _AGC_FENOTCHFILT11_FENOTCHCAPCRSE24_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHCAPCRSE24_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHCAPCRSE24_DEFAULT << 20) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE24_SHIFT      24                                                  /**< Shift value for AGC_FENOTCHCAPFINE24        */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE24_MASK       0xF000000UL                                         /**< Bit mask for AGC_FENOTCHCAPFINE24           */
#define _AGC_FENOTCHFILT11_FENOTCHCAPFINE24_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHCAPFINE24_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHCAPFINE24_DEFAULT << 24) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define AGC_FENOTCHFILT11_FENOTCHRATTNEN24             (0x1UL << 28)                                       /**< FE notch rattn enable for index 24          */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN24_SHIFT      28                                                  /**< Shift value for AGC_FENOTCHRATTNEN24        */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN24_MASK       0x10000000UL                                        /**< Bit mask for AGC_FENOTCHRATTNEN24           */
#define _AGC_FENOTCHFILT11_FENOTCHRATTNEN24_DEFAULT    0x00000000UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHRATTNEN24_DEFAULT     (_AGC_FENOTCHFILT11_FENOTCHRATTNEN24_DEFAULT << 28) /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */
#define AGC_FENOTCHFILT11_FENOTCHEN24                  (0x1UL << 29)                                       /**< FE notch enable for index 24                */
#define _AGC_FENOTCHFILT11_FENOTCHEN24_SHIFT           29                                                  /**< Shift value for AGC_FENOTCHEN24             */
#define _AGC_FENOTCHFILT11_FENOTCHEN24_MASK            0x20000000UL                                        /**< Bit mask for AGC_FENOTCHEN24                */
#define _AGC_FENOTCHFILT11_FENOTCHEN24_DEFAULT         0x00000001UL                                        /**< Mode DEFAULT for AGC_FENOTCHFILT11          */
#define AGC_FENOTCHFILT11_FENOTCHEN24_DEFAULT          (_AGC_FENOTCHFILT11_FENOTCHEN24_DEFAULT << 29)      /**< Shifted mode DEFAULT for AGC_FENOTCHFILT11  */

/* Bit fields for AGC CCADEBUG */
#define _AGC_CCADEBUG_RESETVALUE                       0x00000000UL                                /**< Default value for AGC_CCADEBUG              */
#define _AGC_CCADEBUG_MASK                             0x000003FFUL                                /**< Mask for AGC_CCADEBUG                       */
#define _AGC_CCADEBUG_DEBUGCCARSSI_SHIFT               0                                           /**< Shift value for AGC_DEBUGCCARSSI            */
#define _AGC_CCADEBUG_DEBUGCCARSSI_MASK                0xFFUL                                      /**< Bit mask for AGC_DEBUGCCARSSI               */
#define _AGC_CCADEBUG_DEBUGCCARSSI_DEFAULT             0x00000000UL                                /**< Mode DEFAULT for AGC_CCADEBUG               */
#define AGC_CCADEBUG_DEBUGCCARSSI_DEFAULT              (_AGC_CCADEBUG_DEBUGCCARSSI_DEFAULT << 0)   /**< Shifted mode DEFAULT for AGC_CCADEBUG       */
#define AGC_CCADEBUG_DEBUGCCAM1                        (0x1UL << 8)                                /**< Mode 1 Clear Channel Assessment             */
#define _AGC_CCADEBUG_DEBUGCCAM1_SHIFT                 8                                           /**< Shift value for AGC_DEBUGCCAM1              */
#define _AGC_CCADEBUG_DEBUGCCAM1_MASK                  0x100UL                                     /**< Bit mask for AGC_DEBUGCCAM1                 */
#define _AGC_CCADEBUG_DEBUGCCAM1_DEFAULT               0x00000000UL                                /**< Mode DEFAULT for AGC_CCADEBUG               */
#define AGC_CCADEBUG_DEBUGCCAM1_DEFAULT                (_AGC_CCADEBUG_DEBUGCCAM1_DEFAULT << 8)     /**< Shifted mode DEFAULT for AGC_CCADEBUG       */
#define AGC_CCADEBUG_DEBUGCCASIGDET                    (0x1UL << 9)                                /**< Signal detector Clear Channel Assessment    */
#define _AGC_CCADEBUG_DEBUGCCASIGDET_SHIFT             9                                           /**< Shift value for AGC_DEBUGCCASIGDET          */
#define _AGC_CCADEBUG_DEBUGCCASIGDET_MASK              0x200UL                                     /**< Bit mask for AGC_DEBUGCCASIGDET             */
#define _AGC_CCADEBUG_DEBUGCCASIGDET_DEFAULT           0x00000000UL                                /**< Mode DEFAULT for AGC_CCADEBUG               */
#define AGC_CCADEBUG_DEBUGCCASIGDET_DEFAULT            (_AGC_CCADEBUG_DEBUGCCASIGDET_DEFAULT << 9) /**< Shifted mode DEFAULT for AGC_CCADEBUG       */

/** @} End of group BGM24_AGC_BitFields */
/** @} End of group BGM24_AGC */
/** @} End of group Parts */

#endif /* BGM24_AGC_H */
